#Область ПрограммныйИнтерфейс

// Конструктор сообщения, получаемого от реактивного приложения
//
// Возвращаемое значение:
//  Структура:
//  * ИмяСобытия - Строка - для ветвления по событиям
//  * Ид - Строка - Идентификатор сообщения
//  * Значение - Структура, Массив, Число, Строка, Булево, ДвоичныеДанные, Неопределено - параметры события
//
Функция НовоеСообщение() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяСобытия", "");
	Результат.Вставить("Ид", "");
	Результат.Вставить("Значение", "");
	
	Возврат Результат;
	
КонецФункции

// Перехватыет сообщение из события *ПриНажатии поля HTTP документа и формирует обработку оповещения
// 
// Параметры:
//  ЭтотОбъект - ФормаКлиентскогоПриложения - Форма с которой нужно взаимодействовать
//  ЭлементПолеHTML - ПолеФормы - ПолеHTMLДокумента в которое загружено реактивное приложение
//  ДанныеСобытия - ФиксированнаяСтруктура - См. описание ПриНажатии в синтакс-помощнике
//  СтандартнаяОбработка - Булево - Возвращаемый. Устанавливливается в Ложь если событие реактивного приложения.
//  Обработчик - ОписаниеОповещения - В результат будет возвращен объект См. НовоеСообщение
//
Процедура ОбработатьСообщение(ЭтотОбъект, ЭлементПолеHTML, ДанныеСобытия, СтандартнаяОбработка, Обработчик) Экспорт
	
	ЭлементHTML = ДанныеСобытия["Element"];
	
	Если ЭлементHTML["id"] = "V8WebAppEventRequestForwarder" Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = НовоеСообщение();
		Сообщение.ИмяСобытия = ЭлементHTML.getAttribute("v8eventname");
		Сообщение.Ид = ЭлементHTML.getAttribute("v8uuid");
		
		Тип = ЭлементHTML.getAttribute("v8type");
		Если Тип = "json" Или Тип = "string" Тогда
			Сообщение.Значение = ПрочитатьЗначениеJSON(ЭлементHTML["value"]);
		КонецЕсли;
		
		// Отладка
		Сообщить(СтрШаблон(НСтр("ru = 'Получено %1(%2): %3'"), Сообщение.ИмяСобытия, Сообщение.Ид, ЭлементHTML["value"]));
		
		// Обработчики по-умолчанию
		Если Сообщение.ИмяСобытия = "ShowPopUp" Тогда
			РеактивныйКлиент.ОтправитьОтвет(ЭлементПолеHTML, Сообщение);
			ПоказатьПредупреждение(, Сообщение.Значение["text"]);
		КонецЕсли;
		
		Если Сообщение.ИмяСобытия = "GetFormAttribute" Тогда
			РеактивныйКлиент.ОтправитьОтвет(ЭлементПолеHTML, Сообщение, ЭтотОбъект[Сообщение.Значение]);
		КонецЕсли;
		
		Если Сообщение.ИмяСобытия = "SetFormAttribute" Тогда
			ЭтотОбъект[Сообщение.Значение["key"]] = Сообщение.Значение["value"];
			РеактивныйКлиент.ОтправитьОтвет(ЭлементПолеHTML, Сообщение);
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(Обработчик, Сообщение);
	КонецЕсли;
	
КонецПроцедуры

// Ответ на сообщение от реактивного приложения.
// Каждое сообщение должно получить свой ответ! Хотябы пустой.
//
// Параметры:
//  ЭлементПолеHTML - ПолеФормы - ПолеHTMLДокумента в которое загружено реактивное приложение
//  Сообщение - См. НовыйСообщение - Сообщение, на которпое готовится ответ
//  Ответ - Структура, Массив, Число, Строка, Булево, Неопределено - Ответ, который будет отправлен
//
Процедура ОтправитьОтвет(ЭлементПолеHTML, Сообщение, Ответ = Неопределено) Экспорт
	
	ЭлементHTML = ЭлементПолеHTML.Документ["defaultView"];
	Прокси = ЭлементHTML["V8Proxy"];
	
	Пакет = "";
	Если ЗначениеЗаполнено(Ответ) Тогда
		Если ТипЗнч(Ответ) = Тип("Структура")
			Или ТипЗнч(Ответ) = Тип("ФиксированнаяСтруктура") 
			Или ТипЗнч(Ответ) = Тип("Соответствие")
			Или ТипЗнч(Ответ) = Тип("ФиксированноеСоответствие")
			Или ТипЗнч(Ответ) = Тип("Массив")
			Или ТипЗнч(Ответ) = Тип("ФиксированныйМассив") Тогда
			
			Пакет = ЗаписатьЗначениеJSON(Ответ);
		ИначеЕсли ТипЗнч(Ответ) = Тип("ДвоичныеДанные") Тогда
			Пакет = Base64Строка(Ответ)
		Иначе
			Пакет = XMLСтрока(Ответ);
		КонецЕсли;
	КонецЕсли;
	
	Прокси.sendResponse(Сообщение.Ид, Пакет);
	
	// Отладка
	Сообщить(СтрШаблон(НСтр("ru = 'Отправлен ответ %1(%2): %3'"), Сообщение.ИмяСобытия, Сообщение.Ид, Ответ));
	
КонецПроцедуры
#КонецОбласти

